Documents/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>InformationRegister.УчетнаяПолитика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособСписанияЗапасов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСписанияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособУчетаЗапасов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСписанияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СпособыСписанияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыСписанияЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FEFO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УчетнаяПолитика/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.СпособУчетаЗапасов = СпособСписанияЗапасов;
	
	Если СпособСписанияЗапасов = Перечисления.СпособыСписанияЗапасов.ПоСредней Тогда
		
		Движения.ТоварыНаСкладах.Записывать = Истина;
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ТоварыНаСкладах");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		ЗапросОстатков = Новый Запрос;
		ЗапросОстатков.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыНаСкладахОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Граница, СрокГодности <> ДАТАВРЕМЯ(1, 1, 1)) КАК ТоварыНаСкладахОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	Номенклатура
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(СуммаОстаток)
		|ПО
		|	Склад,
		|	Номенклатура";
		
		ЗапросОстатков.УстановитьПараметр("Граница", Новый Граница(Дата, ВидГраницы.Исключая));
		РезультатОстатков = ЗапросОстатков.Выполнить();
		
		ВыборкаСклад = РезультатОстатков.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			
			ВыборкаНоменклатура = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					ДвижениеРасход = Движения.ТоварыНаСкладах.Добавить();
					ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
					ДвижениеРасход.Период = Дата;
					ДвижениеРасход.Склад = ВыборкаДетальныеЗаписи.Склад;
					ДвижениеРасход.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					ДвижениеРасход.СрокГодности = ВыборкаДетальныеЗаписи.СрокГодности;
					ДвижениеРасход.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
					ДвижениеРасход.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
					
				КонецЦикла;
				
				ДвижениеПриход = Движения.ТоварыНаСкладах.Добавить();
				ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				ДвижениеПриход.Период = Дата;
				ДвижениеПриход.Склад = ВыборкаСклад.Склад;
				ДвижениеПриход.Номенклатура = ВыборкаНоменклатура.Номенклатура;
				ДвижениеПриход.Количество = ВыборкаНоменклатура.КоличествоОстаток;
				ДвижениеПриход.Сумма = ВыборкаНоменклатура.СуммаОстаток;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
